{
  "results": [{
    "id": "ge2-2017",
    "title": "GE2",
    "content": "This weekend Seattle was home the second annual edition of GE2. \n\n\n# GE2 2017\n\n\nGE2 stands for Gaming and Experiential Entertainment Summit.\n\nGE2 was home to a variety of different attractions. \nWith Nerf wars and retro games to Virtual Reality, \nand everything in between. GE2 attracts all types of gamers.\n\n<!--Possibly link spartans-->\n<!--![][Spartans]-->\n\n<!--[Spartans]: /static/api/images/SpartanCosplay.jpg_large 'Me with some Spartan Cosplays'-->\n<img src='/static/api/images/SpartanCosplay.jpg_large' width='800'>\n## Esports (Rocket League)\nAt the main stage, the competitive Rocket League teams from across Washington\nfaced off. I witnessed a heated battle between UW and WSU.\n\nWSU won. 2-4, the final battle was a no-brainer. WSU took an early lead of 4-0.\nUW didn't make back a single point that match.\n\n<!--Link announcers-->\n\n<!--![][Esports]-->\n\n<!--[Esports]: /static/api/images/Esports.jpg_large 'Rocket League announcers'-->\n\n<img src='/static/api/images/Esports.jpg_large' width='800'>\n## Virtual Reality | HTC Vive \n\n\nHTC, Portal VR, and Virtual Sports were the three sponsors behind the 35 live\nVR\npods during the event. Each equipped with an HTC Vive, with a deluxe audio\nstrap,\nan MSI Dominator Pro, and enough Vive stickers for everyone at the event. \n\n\nBy far the most popular demo was Duck Season, by Stress Level Zero, a remake of\nthe classic Duck Hunt on the NES but in VR. You play as the hunter controlled\nby the boy who just got the game for his NES, you can even look behind you and\nsee him controlling you.\n\nThe lines for the VR Village, as a friend of mine likes to call it, were\nextremely\nlong. People told me they had to wait for as long as 3 HOURS, just to play 10\nminutes in VR, even less if you came in a group. \n\n<!--![][Vive]-->\n\n<!--[Vive]: /static/api/images/ViveBooth.jpg_large 'Vive booth'-->\n\n<img src='/static/api/images/ViveBooth.jpg_large' width='800'>\n## Retro Game Arcade\n\n\nThe event also featured an extensive retro arcade. With games like Frogger,\nGalaga, Super Mario Bros, Pac-Man and more people enjoyed playing games for\nhours at a time. \n\nI played a total of 25 games of Street Fighter II with my friend. I beat him\nthe first game, but after that, I lost every single game. I am still recovering to this day.\n\n\n## Pro Drone and RC Car Racing\n\n\nDuring the event, there were races for both the Pro Aerial League and Diehard\nRC. You could hear the announcers the whole time, at any point in the event.\n\n### Pro Drone Racing\n\n\nThe micro-racing drones that ruled the skies had a top speed of 90 mph, with\neach\na pilot wearing a cyberpunk looking headset. The drones whizzed around a figure-8\ntrack with LED lights for days!\n\n\n<!--Link picture of headset here-->\n<img src='/static/api/images/Headset.jpg' width='600'>\n\n> Me wearing a drone racing headset.\n\n\nWe witnessed the final race of the season with a 12 minute race time. The\nwinner, Wilbur scored 32 points (1 lap = 1 point). \n\n\n### RC Racing\n\n\nWhile on the ground the custom build RC Racers of many excited hobbyists\ndrove around the long course featuring multiple jumps, and a long vertical wall\nfor them to ride up and over on.\n\n  The cars had batteries the lasted for about 10\n  minutes each. But the races were 5 minutes only. So drivers could enjoy\n  2 races\n  with there car before needing to switch. Most of the cars were custom built and topped out at 75 mph. \n\n## Indie Game Demos  \n\nWe also got to look at upcoming Indie Games. Such as Super Retromaker, Glider\nIsland VR, Snowball Fight VR, and much more. \n\nI got to experience Glider Island VR. A hang-gliding game in VR. But at GE2\nthey had a massive contraption with a car seat hanging from a bar and a handle\nto grab onto to fly around in VR.\n\n<img src='/static/api/images/Glider.jpg' width='800'>\n\nI also got to play with a really cool game creator, it allows users to easily\nimplement controls from the best games of all time, such as Ninja Gaiden, Super\nMario Bros, Mega Man, and more. You can make your own levels, and share them with\nfriends. Or play some of the community made games.\n\n\n## Nerf, Laser Tag, and Dodge Ball\n\n\nIn addition to the RC, and Video games, there were some casual Nerf Rival and\nLaser Tag Games. Additionally, we played dodgeball, but no one\nreally played by the rules.\n\nDuring the Nerf wars, a group of grown adults marched out onto the field and\nstarted picking on little kids. But to my surprise, the children teamed up and\nwent all out on the adults to the point that they quit, and left the venue.\n\nWe played some laser tag, but we were only allowed one magazine (of co2).\nAfter the magazine runs out you go to the back of the line. So players got to\nplay for 2 minutes before they had to stop. \n\n\n## Conclusion\n\n\nBy the end of the weekend, I enjoyed just about everything GE2 had to throw at\nme, and I'll be honest, I am satisfied. But more than that I am tired. Either\nway, I will be going next year. So maybe I will see you there.\n\n\n<!--![][Forza]-->\n\n<!--[Forza]: /static/api/images/ForzaGE2.jpg_large 'Forza 7 on Xbox One'-->\n\n<img src='/static/api/images/ForzaGE2.jpg_large' width='800'>\n\n> Forza Seven.\n",
    "image": "/static/api/images/Esports.jpg_large",
    "meta": {
      "description": "GE2 2017 Was a blast.",
      "published": "",
      "author": "Avery Wagar"
    }
  }]
}
  
